Thesaru-p/AirTrixx/firmware/antenna_esp32s3/antenna_esp32s3.ino
#include <Arduino.h>
#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>

#if __has_include("../shared/AirTrixxConfig.h")
#include "../shared/AirTrixxConfig.h"
#include "../shared/AirTrixxProtocol.h"
#else
#include "AirTrixxConfig.h"
#include "AirTrixxProtocol.h"
#endif

static SemaphoreHandle_t serialMutex = NULL;

struct LatestWristband {
  bool seen = false;
  uint32_t received_ms = 0;
  WristbandDataPacket packet = {};
};

struct LatestBatteryStatus {
  bool seen = false;
  uint32_t received_ms = 0;
  BatteryStatusPacket packet = {};
};

struct LatestCamDock {
  bool seen = false;
  uint32_t received_ms = 0;
  CamDockDataPacket packet = {};
};

struct LatestFans {
  bool seen = false;
  uint32_t received_ms = 0;
  FanStatusPacket packet = {};
};

struct LatestKeyboard {
  bool seen = false;
  uint32_t received_ms = 0;
  KeyboardTofPacket packet = {};
};

struct LatestChargingDock {
  bool seen = false;
  uint32_t received_ms = 0;
  ChargingDockStatusPacket packet = {};
};

struct LatestAudioDock {
  bool seen = false;
  uint32_t received_ms = 0;
  AudioDockDataPacket packet = {};
};

struct AIRTRIXX_PACKED LegacyFanStatusPacket {
  AirTrixxPacketHeader header;
  uint8_t fan_on;
  uint8_t temp1_valid;
  uint8_t temp2_valid;
  int16_t temp1_centi_c;
  int16_t temp2_centi_c;
  uint16_t last_command_sequence;
};

static LatestWristband latestWristband;
static LatestBatteryStatus latestWristbandBattery;
static LatestCamDock latestCamDock;
static LatestFans latestFans;
static LatestKeyboard latestKeyboard;
static LatestChargingDock latestChargingDock;
static LatestAudioDock latestAudioDock;
static portMUX_TYPE stateMux = portMUX_INITIALIZER_UNLOCKED;

static uint16_t antennaJsonSequence = 0;
static uint16_t servoCommandSequence = 0;
static uint16_t otaCommandSequence = 0;
static uint16_t fanCommandSequence = 0;
static uint32_t lastJsonMs = 0;
static bool isStreamingAudioDock = false;
static uint32_t lastAudioDockChunkMs = 0;
static const uint32_t AUDIODOCK_STREAM_TIMEOUT_MS = 6000;

static QueueHandle_t audioChunkQueue = NULL;

static char serialLine[768];
static size_t serialLineLen = 0;
static const uint32_t BATTERY_STATUS_STALE_MS = 11UL * 60UL * 1000UL;
static const uint8_t ESPNOW_BROADCAST_MAC[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
static const int8_t WIFI_TX_POWER_QDBM = 34;  // 8.5 dBm in 0.25 dBm units.
static const uint8_t ANTENNA_TOTAL_TRACKED_DEVICES = 6;
static const uint32_t ANTENNA_LED_UPDATE_MS = 250;
static const uint32_t AUDIODOCK_LED_TIMEOUT_MS = 30000;
static uint8_t lastAntennaLedState = 255;
static uint32_t lastAntennaLedUpdateMs = 0;

#if defined(RGB_BUILTIN)
static const uint8_t ANTENNA_STATUS_LED_PIN = RGB_BUILTIN;
#else
static const uint8_t ANTENNA_STATUS_LED_PIN = 48;
#endif

void debugPrintln(const String &message) {
  if (DEBUG_SERIAL) {
    if (serialMutex != NULL && xSemaphoreTake(serialMutex, portMAX_DELAY) == pdTRUE) {
      Serial.println(message);
      xSemaphoreGive(serialMutex);
    }
  }
}

void setAntennaStatusLed(uint8_t r, uint8_t g, uint8_t b) {
  neopixelWrite(ANTENNA_STATUS_LED_PIN, r, g, b);
}

bool stateFresh(bool seen, uint32_t receivedMs, uint32_t nowMs, uint32_t timeoutMs = DEVICE_TIMEOUT_MS) {
  return seen && (nowMs - receivedMs <= timeoutMs);
}

uint8_t connectedDeviceCount(uint32_t nowMs) {
  bool wristOk = false;
  bool camOk = false;
  bool keyboardOk = false;
  bool chargingOk = false;
  bool audioOk = false;
  bool fansOk = false;

  portENTER_CRITICAL(&stateMux);
  wristOk = stateFresh(latestWristband.seen, latestWristband.received_ms, nowMs);
  camOk = stateFresh(latestCamDock.seen, latestCamDock.received_ms, nowMs);
  keyboardOk = stateFresh(latestKeyboard.seen, latestKeyboard.received_ms, nowMs);
  chargingOk = stateFresh(latestChargingDock.seen, latestChargingDock.received_ms, nowMs);
  audioOk = stateFresh(latestAudioDock.seen, latestAudioDock.received_ms, nowMs, AUDIODOCK_LED_TIMEOUT_MS);
  fansOk = stateFresh(latestFans.seen, latestFans.received_ms, nowMs);
  portEXIT_CRITICAL(&stateMux);

  uint8_t count = 0;
  if (wristOk) count++;
  if (camOk) count++;
  if (keyboardOk) count++;
  if (chargingOk) count++;
  if (audioOk) count++;
  if (fansOk) count++;
  return count;
}

void updateAntennaStatusLed(uint32_t nowMs) {
  if (nowMs - lastAntennaLedUpdateMs < ANTENNA_LED_UPDATE_MS) {
    return;
  }
  lastAntennaLedUpdateMs = nowMs;

  uint8_t connected = connectedDeviceCount(nowMs);
  if (connected > ANTENNA_TOTAL_TRACKED_DEVICES) {
    connected = ANTENNA_TOTAL_TRACKED_DEVICES;
  }

  if (connected == lastAntennaLedState) {
    return;
  }
  lastAntennaLedState = connected;

  switch (connected) {
    case 0:
      setAntennaStatusLed(32, 0, 0);      // red
      break;
    case 1:
      setAntennaStatusLed(24, 24, 24);    // white
      break;
    case 2:
      setAntennaStatusLed(32, 24, 0);     // yellow
      break;
    case 3:
      setAntennaStatusLed(0, 28, 48);     // ocean blue
      break;
    case 4:
      setAntennaStatusLed(48, 0, 20);     // pink
      break;
    case 5:
      setAntennaStatusLed(28, 0, 48);     // purple
      break;
    default:
      setAntennaStatusLed(0, 32, 0);      // green
      break;
  }
}

void configureWiFiChannel() {
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.disconnect();
  WiFi.setTxPower(WIFI_POWER_8_5dBm);
  esp_wifi_set_ps(WIFI_PS_NONE);
  esp_wifi_set_max_tx_power(WIFI_TX_POWER_QDBM);
  esp_wifi_set_promiscuous(true);
  esp_wifi_set_channel(ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE);
  esp_wifi_set_promiscuous(false);
  esp_wifi_config_80211_tx_rate(WIFI_IF_STA, WIFI_PHY_RATE_1M_L);
}

bool addEspNowPeer(const uint8_t mac[6]) {
  if (esp_now_is_peer_exist(mac)) {
    return true;
  }

  esp_now_peer_info_t peer = {};
  memcpy(peer.peer_addr, mac, 6);
  peer.channel = ESPNOW_CHANNEL;
  peer.encrypt = false;
  peer.ifidx = WIFI_IF_STA;

  esp_err_t result = esp_now_add_peer(&peer);
  if (result != ESP_OK) {
    debugPrintln("ESP-NOW add peer failed: " + String(result));
    return false;
  }
  return true;
}

uint8_t parseActivePair(const String &value) {
  if (value == "right") {
    return ACTIVE_PAIR_RIGHT;
  }
  if (value == "left") {
    return ACTIVE_PAIR_LEFT;
  }
  if (value == "camera") {
    return ACTIVE_PAIR_CAMERA;
  }
  if (value == "hands" || value == "both") {
    return ACTIVE_PAIR_HANDS;
  }
  if (value == "dock") {
    return ACTIVE_PAIR_DOCK;
  }
  return ACTIVE_PAIR_NONE;
}

bool extractStringField(const String &json, const char *key, String &out) {
  String pattern = "\"" + String(key) + "\"";
  int keyIndex = json.indexOf(pattern);
  if (keyIndex < 0) {
    return false;
  }
  int colon = json.indexOf(':', keyIndex + pattern.length());
  if (colon < 0) {
    return false;
  }
  int startQuote = json.indexOf('"', colon + 1);
  if (startQuote < 0) {
    return false;
  }
  int endQuote = json.indexOf('"', startQuote + 1);
  if (endQuote < 0) {
    return false;
  }
  out = json.substring(startQuote + 1, endQuote);
  return true;
}

bool extractBoolField(const String &json, const char *key, bool &out) {
  String pattern = "\"" + String(key) + "\"";
  int keyIndex = json.indexOf(pattern);
  if (keyIndex < 0) {
    return false;
  }
  int colon = json.indexOf(':', keyIndex + pattern.length());
  if (colon < 0) {
    return false;
  }
  int valueStart = colon + 1;
  while (valueStart < json.length() && isspace(json[valueStart])) {
    valueStart++;
  }
  if (json.startsWith("true", valueStart)) {
    out = true;
    return true;
  }
  if (json.startsWith("false", valueStart)) {
    out = false;
    return true;
  }
  return false;
}

bool extractUInt16Field(const String &json, const char *key, uint16_t &out) {
  String pattern = "\"" + String(key) + "\"";
  int keyIndex = json.indexOf(pattern);
  if (keyIndex < 0) {
    return false;
  }
  int colon = json.indexOf(':', keyIndex + pattern.length());
  if (colon < 0) {
    return false;
  }

  int valueStart = colon + 1;
  while (valueStart < json.length() && isspace(json[valueStart])) {
    valueStart++;
  }
  int valueEnd = valueStart;
  while (valueEnd < json.length() && isDigit(json[valueEnd])) {
    valueEnd++;
  }
  if (valueEnd == valueStart) {
    return false;
  }

  long value = json.substring(valueStart, valueEnd).toInt();
  if (value < 0) {
    value = 0;
  }
  if (value > 4095) {
    value = 4095;
  }
  out = static_cast<uint16_t>(value);
  return true;
}

