Thesaru-p/AirTrixx/firmware/antenna_esp32s3/antenna_esp32s3.ino
void copyStringToPacketField(char *field, size_t fieldSize, const String &value) {
  if (field == nullptr || fieldSize == 0) {
    return;
  }
  size_t len = min(static_cast<size_t>(value.length()), fieldSize - 1);
  memcpy(field, value.c_str(), len);
  field[len] = '\0';
}

size_t boundedCStringLength(const char *value, size_t maxLen) {
  size_t len = 0;
  while (len < maxLen && value[len] != '\0') {
    len++;
  }
  return len;
}

void sendServoCommandToCamDock(const ServoCommandPacket &packet) {
  esp_err_t result = esp_now_send(CAMDOCK_MAC_PLACEHOLDER,
                                  reinterpret_cast<const uint8_t *>(&packet),
                                  sizeof(packet));
  if (result != ESP_OK) {
    debugPrintln("ESP-NOW servo send failed: " + String(result));
  }
}

void sendOtaStartToTarget(const OtaStartPacket &packet, const uint8_t mac[6], const char *label) {
  esp_err_t result = esp_now_send(mac,
                                  reinterpret_cast<const uint8_t *>(&packet),
                                  sizeof(packet));
  if (result != ESP_OK) {
    debugPrintln("ESP-NOW " + String(label) + " OTA send failed: " + String(result));
  }
}

void sendOtaStartToFans(const OtaStartPacket &packet) {
  auto sendChunk = [](OtaChunkPacket &chunk, uint8_t repeats) {
    for (uint8_t attempt = 0; attempt < repeats; ++attempt) {
      esp_err_t result = esp_now_send(ESPNOW_BROADCAST_MAC,
                                      reinterpret_cast<const uint8_t *>(&chunk),
                                      sizeof(chunk));
      if (result != ESP_OK) {
        debugPrintln("ESP-NOW fans OTA chunk send failed: " + String(result));
      }
      delay(30);
    }
  };

  auto sendControl = [&](uint8_t fieldId, uint8_t repeats) {
    OtaChunkPacket chunk = {};
    fillHeader(chunk.header,
               MSG_OTA_CHUNK,
               DEVICE_ANTENNA,
               ++otaCommandSequence,
               millis(),
               false);
    chunk.field_id = fieldId;
    sendChunk(chunk, repeats);
  };

  auto sendField = [&](uint8_t fieldId, const char *value, size_t maxLen) {
    size_t totalLen = boundedCStringLength(value, maxLen);
    size_t offset = 0;
    do {
      OtaChunkPacket chunk = {};
      fillHeader(chunk.header,
                 MSG_OTA_CHUNK,
                 DEVICE_ANTENNA,
                 ++otaCommandSequence,
                 millis(),
                 false);
      chunk.field_id = fieldId;
      chunk.offset = static_cast<uint8_t>(offset);
      chunk.total_len = static_cast<uint8_t>(totalLen);
      size_t remaining = totalLen > offset ? totalLen - offset : 0;
      size_t chunkLen = min(static_cast<size_t>(AIRTRIXX_OTA_CHUNK_BYTES), remaining);
      chunk.chunk_len = static_cast<uint8_t>(chunkLen);
      if (chunkLen > 0) {
        memcpy(chunk.data, value + offset, chunkLen);
      }
      sendChunk(chunk, 2);
      offset += chunkLen;
    } while (offset < totalLen);
  };

  sendControl(OTA_FIELD_RESET, 4);
  sendField(OTA_FIELD_SSID, packet.ssid, AIRTRIXX_OTA_SSID_MAX);
  sendField(OTA_FIELD_PASSWORD, packet.password, AIRTRIXX_OTA_PASSWORD_MAX);
  sendField(OTA_FIELD_URL, packet.url, AIRTRIXX_OTA_URL_MAX);
  sendField(OTA_FIELD_MD5, packet.md5, AIRTRIXX_OTA_MD5_MAX);
  sendControl(OTA_FIELD_COMMIT, 8);
}

void sendFanCommandToFans(const FanCommandPacket &packet) {
  esp_err_t result = esp_now_send(ESPNOW_BROADCAST_MAC,
                                  reinterpret_cast<const uint8_t *>(&packet),
                                  sizeof(packet));
  if (result != ESP_OK) {
    debugPrintln("ESP-NOW fan command send failed: " + String(result));
  }
}

void handleOtaJsonCommand(const String &line) {
  String target;
  if (!extractStringField(line, "target", target)) {
    debugPrintln("OTA command missing target");
    return;
  }
  bool targetWristband = target == "wristband";
  bool targetFans = target == "fans" || target == "fan";
  bool targetCamDock = target == "camdock" || target == "cam_dock" || target == "camera_dock";
  if (!targetWristband && !targetFans && !targetCamDock) {
    debugPrintln("Ignoring unsupported OTA target: " + target);
    return;
  }

  String ssid;
  String password;
  String url;
  String md5;
  if (!extractStringField(line, "ssid", ssid) || ssid.length() == 0) {
    debugPrintln("OTA command missing ssid");
    return;
  }
  if (!extractStringField(line, "password", password)) {
    password = "";
  }
  if (!extractStringField(line, "url", url) || url.length() == 0) {
    debugPrintln("OTA command missing url");
    return;
  }
  extractStringField(line, "md5", md5);

  OtaStartPacket packet = {};
  fillHeader(packet.header,
             MSG_OTA_START,
             DEVICE_ANTENNA,
             ++otaCommandSequence,
             millis(),
             false);
  copyStringToPacketField(packet.ssid, sizeof(packet.ssid), ssid);
  copyStringToPacketField(packet.password, sizeof(packet.password), password);
  copyStringToPacketField(packet.url, sizeof(packet.url), url);
  copyStringToPacketField(packet.md5, sizeof(packet.md5), md5);
  if (targetWristband) {
    sendOtaStartToTarget(packet, WRISTBAND_MAC_PLACEHOLDER, "wristband");
  } else if (targetCamDock) {
    sendOtaStartToTarget(packet, CAMDOCK_MAC_PLACEHOLDER, "camdock");
  } else {
    sendOtaStartToFans(packet);
  }
}

void handleFanJsonCommand(const String &line) {
  String target;
  if (!extractStringField(line, "target", target) || target != "fans") {
    debugPrintln("Ignoring non-fans command target");
    return;
  }

  bool fanOn = false;
  if (!extractBoolField(line, "fan_on", fanOn)) {
    debugPrintln("Fans command missing fan_on");
    return;
  }

  FanCommandPacket packet = {};
  fillHeader(packet.header,
             MSG_FAN_COMMAND,
             DEVICE_ANTENNA,
             ++fanCommandSequence,
             millis(),
             false);
  packet.fan_on = fanOn ? 1 : 0;
  sendFanCommandToFans(packet);
}

bool sendAudioDockTextPacket(const String &text, const char *statusPrefix, const String &statusValue = "");

void handleSerialJsonCommand(const String &line) {
  String cmd;
  if (!extractStringField(line, "cmd", cmd)) {
    debugPrintln("Serial command missing cmd");
    return;
  }
  if (cmd == "ota") {
    handleOtaJsonCommand(line);
    return;
  }
  if (cmd == "fans" || cmd == "fan") {
    handleFanJsonCommand(line);
    return;
  }
  if (cmd == "audiodock") {
    String control;
    bool hasControl = extractStringField(line, "control", control) ||
                      extractStringField(line, "action", control);
    if (hasControl) {
      control.trim();
      control.toLowerCase();

      String commandText;
      if (control == "ledtest" || control == "led_test" || control == "led") {
        commandText = "__CMD:LEDTEST__";
      } else if (control == "speakertest" || control == "speaker_test" ||
                 control == "speaker" || control == "spktest") {
        commandText = "__CMD:SPEAKERTEST__";
      } else {
        debugPrintln("Unsupported audiodock control: " + control);
        return;
      }

