Thesaru-p/AirTrixx/firmware/antenna_esp32s3/antenna_esp32s3.ino
      sendAudioDockTextPacket(commandText, "ANTENNA_AUDIODOCK_CONTROL:", control);
      return;
    }

    String transcript;
    if (extractStringField(line, "transcript", transcript)) {
      sendAudioDockTextPacket(transcript, "ANTENNA_AUDIODOCK_TRANSCRIPT:");
    }
    return;
  }
  if (cmd != "servo") {
    debugPrintln("Unsupported command: " + cmd);
    return;
  }

  String target;
  if (!extractStringField(line, "target", target) || target != "camdock") {
    debugPrintln("Ignoring non-camdock servo target");
    return;
  }

  String activePairString;
  if (!extractStringField(line, "active_pair", activePairString)) {
    activePairString = "none";
  }

  bool disableUnused = true;
  extractBoolField(line, "disable_unused", disableUnused);

  ServoCommandPacket packet = {};
  fillHeader(packet.header,
             MSG_SERVO_COMMAND,
             DEVICE_ANTENNA,
             ++servoCommandSequence,
             millis(),
             false);
  packet.active_pair = parseActivePair(activePairString);
  packet.active_mask = maskForActivePair(packet.active_pair);
  packet.disable_unused = disableUnused ? 1 : 0;

  // Packed struct fields may be unaligned, so parse into aligned locals before
  // assigning into the packet.
  uint16_t rPan = 0;
  uint16_t rTilt = 0;
  uint16_t lPan = 0;
  uint16_t lTilt = 0;
  uint16_t camPan = 0;
  uint16_t camTilt = 0;
  extractUInt16Field(line, "r_pan", rPan);
  extractUInt16Field(line, "r_tilt", rTilt);
  extractUInt16Field(line, "l_pan", lPan);
  extractUInt16Field(line, "l_tilt", lTilt);
  extractUInt16Field(line, "cam_pan", camPan);
  extractUInt16Field(line, "cam_tilt", camTilt);
  packet.r_pan = rPan;
  packet.r_tilt = rTilt;
  packet.l_pan = lPan;
  packet.l_tilt = lTilt;
  packet.cam_pan = camPan;
  packet.cam_tilt = camTilt;

  sendServoCommandToCamDock(packet);
}

void pumpSerialCommands() {
  if (serialMutex != NULL && xSemaphoreTake(serialMutex, portMAX_DELAY) == pdTRUE) {
    while (Serial.available() > 0) {
      char c = static_cast<char>(Serial.read());
      if (c == '\r') {
        continue;
      }
      if (c == '\n') {
        serialLine[serialLineLen] = '\0';
        if (serialLineLen > 0) {
          String line(serialLine);
          line.trim();
          if (line.length() > 0) {
            // Unlock mutex before calling command handler to prevent recursive deadlocks
            xSemaphoreGive(serialMutex);
            handleSerialJsonCommand(line);
            if (xSemaphoreTake(serialMutex, portMAX_DELAY) != pdTRUE) {
              serialLineLen = 0;
              return;
            }
          }
        }
        serialLineLen = 0;
        continue;
      }
      if (serialLineLen < sizeof(serialLine) - 1) {
        serialLine[serialLineLen++] = c;
      } else {
        serialLineLen = 0;
        xSemaphoreGive(serialMutex);
        debugPrintln("Serial command too long; dropped");
        if (xSemaphoreTake(serialMutex, portMAX_DELAY) != pdTRUE) return;
      }
    }
    xSemaphoreGive(serialMutex);
  }
}

bool sendAudioDockTextPacket(const String &text, const char *statusPrefix, const String &statusValue) {
  uint8_t okCount = 0;
  esp_err_t lastResult = ESP_FAIL;

  for (uint8_t attempt = 0; attempt < 8; attempt++) {
    AudioDockTranscriptPacket packet = {};
    fillHeader(packet.header,
               MSG_AUDIODOCK_TRANSCRIPT,
               DEVICE_ANTENNA,
               ++antennaJsonSequence,
               millis(),
               false);
    copyStringToPacketField(packet.transcript, sizeof(packet.transcript), text);
    lastResult = esp_now_send(ESPNOW_BROADCAST_MAC,
                              reinterpret_cast<const uint8_t *>(&packet),
                              sizeof(packet));
    if (lastResult == ESP_OK) {
      okCount++;
    }
    delay(35);
  }

  if (serialMutex != NULL && xSemaphoreTake(serialMutex, portMAX_DELAY) == pdTRUE) {
    Serial.print(statusPrefix);
    if (statusValue.length() > 0) {
      Serial.print(statusValue);
      Serial.print(",");
    }
    Serial.print(okCount > 0 ? "sent" : "failed");
    Serial.print(",ok=");
    Serial.print(okCount);
    Serial.print(",last=");
    Serial.println(lastResult);
    xSemaphoreGive(serialMutex);
  }

  return okCount > 0;
}

void handleIncomingPacket(const uint8_t *data, int len) {
  if (len < static_cast<int>(sizeof(AirTrixxPacketHeader))) {
    return;
  }

  AirTrixxPacketHeader header = {};
  memcpy(&header, data, sizeof(header));
  if (header.protocol_version != AIRTRIXX_PROTOCOL_VERSION) {
    return;
  }

  if (header.msg_type == MSG_WRISTBAND_DATA && len == static_cast<int>(sizeof(WristbandDataPacket))) {
    WristbandDataPacket packet = {};
    memcpy(&packet, data, sizeof(packet));
    portENTER_CRITICAL(&stateMux);
    latestWristband.packet = packet;
    latestWristband.seen = true;
    latestWristband.received_ms = millis();
    portEXIT_CRITICAL(&stateMux);
  } else if (header.msg_type == MSG_BATTERY_STATUS &&
             header.device_id == DEVICE_WRISTBAND &&
             len == static_cast<int>(sizeof(BatteryStatusPacket))) {
    BatteryStatusPacket packet = {};
    memcpy(&packet, data, sizeof(packet));
    portENTER_CRITICAL(&stateMux);
    latestWristbandBattery.packet = packet;
    latestWristbandBattery.seen = true;
    latestWristbandBattery.received_ms = millis();
    portEXIT_CRITICAL(&stateMux);
  } else if (header.msg_type == MSG_CAMDOCK_DATA && len == static_cast<int>(sizeof(CamDockDataPacket))) {
    CamDockDataPacket packet = {};
    memcpy(&packet, data, sizeof(packet));
    portENTER_CRITICAL(&stateMux);
    latestCamDock.packet = packet;
    latestCamDock.seen = true;
    latestCamDock.received_ms = millis();
    portEXIT_CRITICAL(&stateMux);
  } else if (header.msg_type == MSG_KEYBOARD_TOF && len == static_cast<int>(sizeof(KeyboardTofPacket))) {
    KeyboardTofPacket packet = {};
    memcpy(&packet, data, sizeof(packet));
    if (packet.header.device_id != DEVICE_KEYBOARD) {
      return;
    }
    portENTER_CRITICAL(&stateMux);
    latestKeyboard.packet = packet;
    latestKeyboard.seen = true;
    latestKeyboard.received_ms = millis();
    portEXIT_CRITICAL(&stateMux);
  } else if (header.msg_type == MSG_CHARGING_DOCK_STATUS &&
             len == static_cast<int>(sizeof(ChargingDockStatusPacket))) {
    ChargingDockStatusPacket packet = {};
    memcpy(&packet, data, sizeof(packet));
    if (packet.header.device_id != DEVICE_CHARGING_DOCK) {
      return;
    }
    portENTER_CRITICAL(&stateMux);
    latestChargingDock.packet = packet;
    latestChargingDock.seen = true;
    latestChargingDock.received_ms = millis();
    portEXIT_CRITICAL(&stateMux);
  } else if (header.msg_type == MSG_FAN_STATUS && len == static_cast<int>(sizeof(FanStatusPacket))) {
    FanStatusPacket packet = {};
    memcpy(&packet, data, sizeof(packet));
    if (packet.header.device_id != DEVICE_FANS) {
      return;
    }
    portENTER_CRITICAL(&stateMux);
    latestFans.packet = packet;
    latestFans.seen = true;
    latestFans.received_ms = millis();
    portEXIT_CRITICAL(&stateMux);
  } else if (header.msg_type == MSG_FAN_STATUS &&
             len == static_cast<int>(sizeof(LegacyFanStatusPacket))) {
    LegacyFanStatusPacket legacy = {};
    memcpy(&legacy, data, sizeof(legacy));
    if (legacy.header.device_id != DEVICE_FANS) {
      return;
    }
    FanStatusPacket packet = {};
    packet.header = legacy.header;
    packet.fan_on = legacy.fan_on;
    packet.temp1_valid = legacy.temp1_valid;
    packet.temp2_valid = legacy.temp2_valid;
    packet.temp1_centi_c = legacy.temp1_centi_c;
    packet.temp2_centi_c = legacy.temp2_centi_c;
    packet.last_command_sequence = legacy.last_command_sequence;
    packet.battery_valid = 0;
    portENTER_CRITICAL(&stateMux);
    latestFans.packet = packet;
    latestFans.seen = true;
    latestFans.received_ms = millis();
    portEXIT_CRITICAL(&stateMux);
  } else if (header.msg_type == MSG_AUDIODOCK_DATA && len == static_cast<int>(sizeof(AudioDockDataPacket))) {
    AudioDockDataPacket packet = {};
    memcpy(&packet, data, sizeof(packet));
    if (packet.header.device_id != DEVICE_AUDIODOCK) {
      return;
    }
    portENTER_CRITICAL(&stateMux);
    latestAudioDock.packet = packet;
    latestAudioDock.seen = true;
    latestAudioDock.received_ms = millis();
    portEXIT_CRITICAL(&stateMux);
    
    isStreamingAudioDock = true;
    lastAudioDockChunkMs = millis();
    
    if (serialMutex != NULL && xSemaphoreTake(serialMutex, portMAX_DELAY) == pdTRUE) {
      Serial.printf("AUDIODOCK_TRIGGER:%d,%d\n", packet.clap_type, packet.audio_size);
      xSemaphoreGive(serialMutex);
    }
  } else if (header.msg_type == MSG_AUDIODOCK_AUDIO_CHUNK && len == static_cast<int>(sizeof(AudioDockChunkPacket))) {
    AudioDockChunkPacket packet = {};
    memcpy(&packet, data, sizeof(packet));
    if (packet.header.device_id != DEVICE_AUDIODOCK) {
      return;
    }
    
    isStreamingAudioDock = true;
    lastAudioDockChunkMs = millis();
    
    if (audioChunkQueue != NULL) {
      xQueueSend(audioChunkQueue, &packet, 0);
    }
  } else if (DEBUG_SERIAL) {
    debugPrintln("Unexpected ESP-NOW packet type/size");
  }
}

#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void onDataRecv(const esp_now_recv_info_t *info, const uint8_t *incomingData, int len) {
  (void)info;
  handleIncomingPacket(incomingData, len);
}
#else
void onDataRecv(const uint8_t *mac, const uint8_t *incomingData, int len) {
  (void)mac;
  handleIncomingPacket(incomingData, len);
}
#endif

void printWristbandJson(const LatestWristband &snapshot,
                        const LatestBatteryStatus &batterySnapshot,
                        uint32_t nowMs) {
  bool ok = snapshot.seen && (nowMs - snapshot.received_ms <= DEVICE_TIMEOUT_MS);
  bool batteryKnown = batterySnapshot.seen;
  bool batteryFresh = batteryKnown && (nowMs - batterySnapshot.received_ms <= BATTERY_STATUS_STALE_MS);
  bool batteryValid = batteryFresh && batterySnapshot.packet.battery_valid != 0;
  Serial.print("\"wristband\":{");
  Serial.print("\"status\":\"");
  Serial.print(ok ? "ok" : "not_connected");
  Serial.print("\",\"battery_level\":");
  if (batteryValid) {
    Serial.print(batterySnapshot.packet.battery_percent);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"battery_voltage\":");
  if (batteryValid) {
    Serial.print(batterySnapshot.packet.battery_mv / 1000.0f, 3);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"battery\":{\"status\":\"");
  if (!batteryKnown) {
    Serial.print("unknown");
  } else if (!batteryFresh) {
    Serial.print("stale");
  } else if (!batteryValid) {
    Serial.print("invalid");
  } else {
    Serial.print("ok");
  }
  Serial.print("\",\"percent\":");
  if (batteryValid) {
    Serial.print(batterySnapshot.packet.battery_percent);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"voltage_v\":");
  if (batteryValid) {
    Serial.print(batterySnapshot.packet.battery_mv / 1000.0f, 3);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"adc_raw\":");
  if (batteryKnown) {
    Serial.print(batterySnapshot.packet.battery_adc_raw);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"age_ms\":");
  if (batteryKnown) {
    Serial.print(nowMs - batterySnapshot.received_ms);
  } else {
    Serial.print("null");
  }
  Serial.print("}");
  Serial.print(",\"sequence\":");
  if (ok) {
    Serial.print(snapshot.packet.header.sequence);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"t_ms\":");
  if (ok) {
    Serial.print(snapshot.packet.header.t_ms);
  } else {
    Serial.print("null");
  }

  if (ok) {
    float ax = snapshot.packet.accel_mg_x * AIRTRIXX_ACCEL_MG_TO_MPS2;
    float ay = snapshot.packet.accel_mg_y * AIRTRIXX_ACCEL_MG_TO_MPS2;
    float az = snapshot.packet.accel_mg_z * AIRTRIXX_ACCEL_MG_TO_MPS2;
    float gx = snapshot.packet.gyro_mdps_x * AIRTRIXX_GYRO_MDPS_TO_DPS;
    float gy = snapshot.packet.gyro_mdps_y * AIRTRIXX_GYRO_MDPS_TO_DPS;
    float gz = snapshot.packet.gyro_mdps_z * AIRTRIXX_GYRO_MDPS_TO_DPS;
    float pitch = snapshot.packet.pitch_cdeg * AIRTRIXX_CDEG_TO_DEG;
    float roll = snapshot.packet.roll_cdeg * AIRTRIXX_CDEG_TO_DEG;

    Serial.print(",\"accel\":{\"x\":");
    Serial.print(ax, 3);
    Serial.print(",\"y\":");
    Serial.print(ay, 3);
    Serial.print(",\"z\":");
    Serial.print(az, 3);
    Serial.print("},\"gyro\":{\"x\":");
    Serial.print(gx, 3);
    Serial.print(",\"y\":");
    Serial.print(gy, 3);
    Serial.print(",\"z\":");
    Serial.print(gz, 3);
    Serial.print("},\"pitch\":");
    Serial.print(pitch, 2);
    Serial.print(",\"roll\":");
    Serial.print(roll, 2);
    Serial.print(",\"yaw\":null");
  } else {
    Serial.print(",\"accel\":{\"x\":null,\"y\":null,\"z\":null}");
    Serial.print(",\"gyro\":{\"x\":null,\"y\":null,\"z\":null}");
    Serial.print(",\"pitch\":null,\"roll\":null,\"yaw\":null");
  }
  Serial.print("}");
}

void printCamDockJson(const LatestCamDock &snapshot, uint32_t nowMs) {
  bool ok = snapshot.seen && (nowMs - snapshot.received_ms <= DEVICE_TIMEOUT_MS);
  bool batteryValid = ok && snapshot.packet.battery_valid != 0;
  Serial.print("\"camdock\":{");
  Serial.print("\"status\":\"");
  Serial.print(ok ? "ok" : "not_connected");
  Serial.print("\",\"battery_level\":");
  if (batteryValid) {
    Serial.print(snapshot.packet.battery_percent);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"battery_voltage\":");
  if (batteryValid) {
    Serial.print(snapshot.packet.battery_mv / 1000.0f, 3);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"battery\":{\"status\":\"");
  if (!ok) {
    Serial.print("not_connected");
  } else if (!batteryValid) {
    Serial.print("invalid");
  } else {
    Serial.print("ok");
  }
  Serial.print("\",\"percent\":");
  if (batteryValid) {
    Serial.print(snapshot.packet.battery_percent);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"voltage_v\":");
  if (batteryValid) {
    Serial.print(snapshot.packet.battery_mv / 1000.0f, 3);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"adc_raw\":");
  if (ok) {
    Serial.print(snapshot.packet.battery_adc_raw);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"age_ms\":");
  if (ok) {
    Serial.print(nowMs - snapshot.received_ms);
  } else {
    Serial.print("null");
  }
  Serial.print("}");
  Serial.print(",\"sequence\":");
  if (ok) {
    Serial.print(snapshot.packet.header.sequence);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"t_ms\":");
  if (ok) {
    Serial.print(snapshot.packet.header.t_ms);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"tof\":{\"left_mm\":");
  if (ok) {
    Serial.print(snapshot.packet.left_tof_mm);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"right_mm\":");
  if (ok) {
    Serial.print(snapshot.packet.right_tof_mm);
  } else {
    Serial.print("null");
  }
  Serial.print("},\"active_target\":\"");
  Serial.print(ok ? activePairToString(snapshot.packet.active_target) : "none");
  Serial.print("\"}");
}

void printNullableTempC(bool ok, uint8_t valid, int16_t centiC) {
  if (ok && valid != 0) {
    Serial.print(centiC / 100.0f, 2);
  } else {
    Serial.print("null");
  }
}

