Thesaru-p/AirTrixx/firmware/antenna_esp32s3/antenna_esp32s3.ino
void printNullableDistanceMm(bool ok, uint8_t valid, uint16_t distanceMm) {
  if (ok && valid != 0) {
    Serial.print(distanceMm);
  } else {
    Serial.print("null");
  }
}

void printKeyboardJson(const LatestKeyboard &snapshot, uint32_t nowMs) {
  bool ok = snapshot.seen && (nowMs - snapshot.received_ms <= DEVICE_TIMEOUT_MS);
  Serial.print("\"keyboard\":{");
  Serial.print("\"status\":\"");
  Serial.print(ok ? "ok" : "not_connected");
  Serial.print("\",\"input\":\"");
  Serial.print(ok ? "tof" : "off");
  Serial.print("\",\"battery_level\":null");
  Serial.print(",\"sequence\":");
  if (ok) {
    Serial.print(snapshot.packet.header.sequence);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"t_ms\":");
  if (ok) {
    Serial.print(snapshot.packet.header.t_ms);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"tof\":{\"sensor_1_mm\":");
  printNullableDistanceMm(ok, snapshot.packet.valid_1, snapshot.packet.distance_mm_1);
  Serial.print(",\"sensor_2_mm\":");
  printNullableDistanceMm(ok, snapshot.packet.valid_2, snapshot.packet.distance_mm_2);
  Serial.print(",\"sensor_3_mm\":");
  printNullableDistanceMm(ok, snapshot.packet.valid_3, snapshot.packet.distance_mm_3);
  Serial.print(",\"sensor_4_mm\":");
  printNullableDistanceMm(ok, snapshot.packet.valid_4, snapshot.packet.distance_mm_4);
  Serial.print("},\"valid\":{\"sensor_1\":");
  Serial.print(ok && snapshot.packet.valid_1 != 0 ? "true" : "false");
  Serial.print(",\"sensor_2\":");
  Serial.print(ok && snapshot.packet.valid_2 != 0 ? "true" : "false");
  Serial.print(",\"sensor_3\":");
  Serial.print(ok && snapshot.packet.valid_3 != 0 ? "true" : "false");
  Serial.print(",\"sensor_4\":");
  Serial.print(ok && snapshot.packet.valid_4 != 0 ? "true" : "false");
  Serial.print("}}");
}

void printFansJson(const LatestFans &snapshot, uint32_t nowMs) {
  bool ok = snapshot.seen && (nowMs - snapshot.received_ms <= DEVICE_TIMEOUT_MS);
  bool fanOn = ok && snapshot.packet.fan_on != 0;
  bool batteryValid = ok && snapshot.packet.battery_valid != 0;
  Serial.print("\"fans\":{");
  Serial.print("\"status\":\"");
  Serial.print(ok ? "ok" : "not_connected");
  Serial.print("\",\"input\":\"");
  Serial.print(fanOn ? "on" : "off");
  Serial.print("\",\"battery_level\":");
  if (batteryValid) {
    Serial.print(snapshot.packet.battery_percent);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"battery_voltage\":");
  if (batteryValid) {
    Serial.print(snapshot.packet.battery_mv / 1000.0f, 3);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"battery\":{\"status\":\"");
  if (!ok) {
    Serial.print("not_connected");
  } else if (!batteryValid) {
    Serial.print("invalid");
  } else {
    Serial.print("ok");
  }
  Serial.print("\",\"percent\":");
  if (batteryValid) {
    Serial.print(snapshot.packet.battery_percent);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"voltage_v\":");
  if (batteryValid) {
    Serial.print(snapshot.packet.battery_mv / 1000.0f, 3);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"adc_raw\":");
  if (ok) {
    Serial.print(snapshot.packet.battery_adc_raw);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"age_ms\":");
  if (ok) {
    Serial.print(nowMs - snapshot.received_ms);
  } else {
    Serial.print("null");
  }
  Serial.print("}");
  Serial.print(",\"fan_on\":");
  Serial.print(fanOn ? "true" : "false");
  Serial.print(",\"sequence\":");
  if (ok) {
    Serial.print(snapshot.packet.header.sequence);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"t_ms\":");
  if (ok) {
    Serial.print(snapshot.packet.header.t_ms);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"last_command_sequence\":");
  if (ok) {
    Serial.print(snapshot.packet.last_command_sequence);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"temps\":{\"sensor_1_c\":");
  printNullableTempC(ok, snapshot.packet.temp1_valid, snapshot.packet.temp1_centi_c);
  Serial.print(",\"sensor_2_c\":");
  printNullableTempC(ok, snapshot.packet.temp2_valid, snapshot.packet.temp2_centi_c);
  Serial.print("}}");
}

const char *chargingDockChannelName(uint8_t index) {
  switch (index) {
    case 0: return "FN";
    case 1: return "AD";
    case 2: return "KB";
    case 3: return "WB";
    default: return "CH";
  }
}

bool maskHas(uint8_t mask, uint8_t index) {
  return (mask & (1 << index)) != 0;
}

const char *chargingDockInput(const ChargingDockStatusPacket &packet, bool ok) {
  if (!ok) {
    return "off";
  }
  if (packet.hot_mask != 0) {
    return "hot";
  }
  if (packet.charging_mask != 0) {
    return "charging";
  }
  return "idle";
}

const char *chargingDockChannelStatus(const ChargingDockStatusPacket &packet, bool ok, uint8_t index) {
  if (!ok) {
    return "not_connected";
  }
  if (!maskHas(packet.ina_valid_mask, index)) {
    return "ina_error";
  }
  if (maskHas(packet.hot_mask, index)) {
    return "hot";
  }
  if (!maskHas(packet.battery_present_mask, index)) {
    return "no_battery";
  }
  if (maskHas(packet.full_mask, index)) {
    return "full";
  }
  if (maskHas(packet.charging_mask, index)) {
    return "charging";
  }
  return "idle";
}

void printChargingDockJson(const LatestChargingDock &snapshot, uint32_t nowMs) {
  bool ok = snapshot.seen && (nowMs - snapshot.received_ms <= DEVICE_TIMEOUT_MS);
  const ChargingDockStatusPacket &packet = snapshot.packet;
  uint16_t presentCount = 0;
  uint16_t chargingCount = 0;
  uint16_t percentSum = 0;
  uint32_t mvSum = 0;

  if (ok) {
    for (uint8_t i = 0; i < AIRTRIXX_CHARGING_DOCK_CHANNELS; ++i) {
      if (maskHas(packet.battery_present_mask, i)) {
        presentCount++;
        percentSum += packet.battery_percent[i];
        mvSum += packet.battery_mv[i];
      }
      if (maskHas(packet.charging_mask, i)) {
        chargingCount++;
      }
    }
  }

  Serial.print("\"charging_dock\":{");
  Serial.print("\"status\":\"");
  Serial.print(ok ? "ok" : "not_connected");
  Serial.print("\",\"input\":\"");
  Serial.print(chargingDockInput(packet, ok));
  Serial.print("\",\"battery_level\":");
  if (presentCount > 0) {
    Serial.print(static_cast<int>((percentSum + (presentCount / 2)) / presentCount));
  } else {
    Serial.print("null");
  }
  Serial.print(",\"battery_voltage\":");
  if (presentCount > 0) {
    Serial.print((static_cast<float>(mvSum) / presentCount) / 1000.0f, 3);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"sequence\":");
  if (ok) {
    Serial.print(packet.header.sequence);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"t_ms\":");
  if (ok) {
    Serial.print(packet.header.t_ms);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"active_tab\":");
  if (ok) {
    Serial.print(packet.active_tab);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"priority_channel\":");
  if (ok && packet.priority_channel >= 0 &&
      packet.priority_channel < static_cast<int8_t>(AIRTRIXX_CHARGING_DOCK_CHANNELS)) {
    Serial.print("\"");
    Serial.print(chargingDockChannelName(packet.priority_channel));
    Serial.print("\"");
  } else {
    Serial.print("null");
  }
  Serial.print(",\"present_count\":");
  Serial.print(ok ? presentCount : 0);
  Serial.print(",\"charging_count\":");
  Serial.print(ok ? chargingCount : 0);
  Serial.print(",\"channels\":[");
  for (uint8_t i = 0; i < AIRTRIXX_CHARGING_DOCK_CHANNELS; ++i) {
    if (i > 0) {
      Serial.print(",");
    }
    bool inaValid = ok && maskHas(packet.ina_valid_mask, i);
    bool batteryPresent = ok && maskHas(packet.battery_present_mask, i);
    bool tempValid = ok && maskHas(packet.temp_valid_mask, i);
    Serial.print("{\"name\":\"");
    Serial.print(chargingDockChannelName(i));
    Serial.print("\",\"status\":\"");
    Serial.print(chargingDockChannelStatus(packet, ok, i));
    Serial.print("\",\"charging\":");
    Serial.print(ok && maskHas(packet.charging_mask, i) ? "true" : "false");
    Serial.print(",\"battery_level\":");
    if (batteryPresent) {
      Serial.print(packet.battery_percent[i]);
    } else {
      Serial.print("null");
    }
    Serial.print(",\"battery_voltage\":");
    if (batteryPresent) {
      Serial.print(packet.battery_mv[i] / 1000.0f, 3);
    } else {
      Serial.print("null");
    }
    Serial.print(",\"current_ma\":");
    if (inaValid) {
      Serial.print(packet.current_ma[i]);
    } else {
      Serial.print("null");
    }
    Serial.print(",\"temp_c\":");
    if (tempValid) {
      Serial.print(packet.temp_centi_c[i] / 100.0f, 2);
    } else {
      Serial.print("null");
    }
    Serial.print(",\"energy_mah\":");
    Serial.print(ok ? packet.energy_mah[i] : 0);
    Serial.print("}");
  }
  Serial.print("]}");
}

