Thesaru-p/AirTrixx/firmware/antenna_esp32s3/antenna_esp32s3.ino
void printFutureDeviceJson(const char *name) {
  Serial.print("\"");
  Serial.print(name);
  Serial.print("\":{\"status\":\"TBD\",\"input\":\"TBD\",\"battery_level\":null}");
}

void printAudioDockJson(const LatestAudioDock &snapshot, uint32_t nowMs) {
  bool ok = snapshot.seen && (nowMs - snapshot.received_ms <= DEVICE_TIMEOUT_MS);
  Serial.print("\"audiodock\":{");
  Serial.print("\"status\":\"");
  Serial.print(ok ? "ok" : "not_connected");
  Serial.print("\",\"battery_level\":null");
  Serial.print(",\"sequence\":");
  if (ok) {
    Serial.print(snapshot.packet.header.sequence);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"t_ms\":");
  if (ok) {
    Serial.print(snapshot.packet.header.t_ms);
  } else {
    Serial.print("null");
  }
  Serial.print(",\"clap_detected\":");
  Serial.print(ok && snapshot.packet.clap_detected ? "true" : "false");
  Serial.print(",\"clap_type\":");
  if (ok) {
    Serial.print(snapshot.packet.clap_type);
  } else {
    Serial.print("null");
  }
  Serial.print("}");
}

void printJsonState() {
  LatestWristband wristSnapshot;
  LatestBatteryStatus wristBatterySnapshot;
  LatestCamDock camSnapshot;
  LatestFans fansSnapshot;
  LatestKeyboard keyboardSnapshot;
  LatestChargingDock chargingDockSnapshot;
  LatestAudioDock audiodockSnapshot;
  uint32_t nowMs = millis();

  portENTER_CRITICAL(&stateMux);
  wristSnapshot = latestWristband;
  wristBatterySnapshot = latestWristbandBattery;
  camSnapshot = latestCamDock;
  fansSnapshot = latestFans;
  keyboardSnapshot = latestKeyboard;
  chargingDockSnapshot = latestChargingDock;
  audiodockSnapshot = latestAudioDock;
  portEXIT_CRITICAL(&stateMux);

  if (serialMutex != NULL && xSemaphoreTake(serialMutex, portMAX_DELAY) == pdTRUE) {
    Serial.print("{\"t_ms\":");
    Serial.print(nowMs);
    Serial.print(",\"sequence\":");
    Serial.print(++antennaJsonSequence);
    
    uint8_t mac[6] = {};
    WiFi.macAddress(mac);
    char macStr[18];
    snprintf(macStr, sizeof(macStr), "%02X:%02X:%02X:%02X:%02X:%02X",
             mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    Serial.print(",\"antenna_mac\":\"");
    Serial.print(macStr);
    Serial.print("\"");

    Serial.print(",\"devices\":{");
    printWristbandJson(wristSnapshot, wristBatterySnapshot, nowMs);
    Serial.print(",");
    printCamDockJson(camSnapshot, nowMs);
    Serial.print(",");
    printKeyboardJson(keyboardSnapshot, nowMs);
    Serial.print(",");
    printChargingDockJson(chargingDockSnapshot, nowMs);
    Serial.print(",");
    printAudioDockJson(audiodockSnapshot, nowMs);
    Serial.print(",");
    printFansJson(fansSnapshot, nowMs);
    Serial.println("}}");
    xSemaphoreGive(serialMutex);
  }
}

void setup() {
  Serial.setRxBufferSize(2048);
  Serial.setTxBufferSize(2048);
  Serial.begin(AIRTRIXX_SERIAL_BAUD);
  delay(200);
  setAntennaStatusLed(32, 0, 0);

  // Initialize the thread-safe FreeRTOS Mutex for Serial operations
  serialMutex = xSemaphoreCreateMutex();

  // Create FreeRTOS queue for Audio Dock chunks
  audioChunkQueue = xQueueCreate(64, sizeof(AudioDockChunkPacket));

  configureWiFiChannel();
  
  // Read and print actual physical MAC address
  uint8_t mac[6] = {};
  WiFi.macAddress(mac);
  char macStr[18];
  snprintf(macStr, sizeof(macStr), "%02X:%02X:%02X:%02X:%02X:%02X",
           mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  if (serialMutex != NULL && xSemaphoreTake(serialMutex, portMAX_DELAY) == pdTRUE) {
    Serial.print("ANTENNA_MAC: ");
    Serial.println(macStr);
    xSemaphoreGive(serialMutex);
  }

  if (esp_now_init() != ESP_OK) {
    debugPrintln("ESP-NOW init failed");
    return;
  }
  esp_now_register_recv_cb(onDataRecv);
  addEspNowPeer(CAMDOCK_MAC_PLACEHOLDER);
  addEspNowPeer(WRISTBAND_MAC_PLACEHOLDER);
  addEspNowPeer(KEYBOARD_MAC_PLACEHOLDER);
  addEspNowPeer(CHARGING_DOCK_MAC_PLACEHOLDER);
  addEspNowPeer(FANS_MAC_PLACEHOLDER);
  addEspNowPeer(AUDIODOCK_MAC_PLACEHOLDER);
  addEspNowPeer(ESPNOW_BROADCAST_MAC);
}

void pumpAudioDockChunks() {
  if (audioChunkQueue == NULL) return;

  AudioDockChunkPacket packet;
  while (xQueueReceive(audioChunkQueue, &packet, 0) == pdPASS) {
    char hexBuf[401];
    uint16_t writeLen = packet.chunk_len;
    if (writeLen > 200) writeLen = 200;
    for (uint16_t i = 0; i < writeLen; ++i) {
      sprintf(hexBuf + (i * 2), "%02X", packet.data[i]);
    }
    hexBuf[writeLen * 2] = '\0';
    
    if (serialMutex != NULL && xSemaphoreTake(serialMutex, portMAX_DELAY) == pdTRUE) {
      Serial.print("AUDIODOCK_AUDIO:");
      Serial.println(hexBuf);
      xSemaphoreGive(serialMutex);
    }
  }
}

void loop() {
  pumpAudioDockChunks();
  pumpSerialCommands();

  uint32_t nowMs = millis();
  updateAntennaStatusLed(nowMs);
  
  if (isStreamingAudioDock && (nowMs - lastAudioDockChunkMs >= AUDIODOCK_STREAM_TIMEOUT_MS)) {
    isStreamingAudioDock = false;
  }

  const uint32_t intervalMs = 1000UL / ANTENNA_JSON_HZ;
  if (!isStreamingAudioDock && (nowMs - lastJsonMs >= intervalMs)) {
    lastJsonMs = nowMs;
    printJsonState();
  }
}
